app/Http/Controllers/Admin/AdminController.php

select * from `specialities` limit 10 offset 0
select count(*) as aggregate from `specialities`
---
    public function speciality_show()
    {
        $data = Speciality::paginate(10);

select * from `specialities` where `specialities`.`id` = '24' limit 1
---
    public function speciality_edit($id)
    {
        $speciality = Speciality::find($id);

select * from `specialities` where `specialities`.`id` = '16' limit 1
---
    public function update_speciality(Request $request, $id)
    {
        $speciality = Speciality::find($id);

select * from `doctors` limit 5 offset 0
select count(*) as aggregate from `doctors`
select * from `specialities`
---
    public function alldoctor()
    {
        //$doctor = Doctor::all()->paginate(10);
        $doctor = Doctor::paginate(5);
        $specialities = Speciality::all();

select * from `doctors` where `doctors`.`id` = '1' limit 1
select * from `specialities`
---
    public function Editdoctor($id)
    {
        $doctor = Doctor::find($id);
        $speciality = Speciality::all();

select * from `appointments` limit 5 offset 0
select count(*) as aggregate from `appointments`
---
    public function showappoinment()
    {
        // $user=User::user()->name;
        // $data= Appointment::where('user_id',$user)->get();
        $data = Appointment::paginate(5);

select * from `appointments` where `appointments`.`id` = '1' limit 1
update `appointments` set `status` = 'approved', `appointments`.`updated_at` = '2023-08-29 13:04:57' where `id` = 1
---
    public function Approved($id)
    {
        $approved = Appointment::find($id);
        $approved->status = 'approved';
        $approved->save();

select * from `patients` limit 5 offset 0
select count(*) as aggregate from `patients`
---
    public function patient_doctor_list()
    {

        $patient = Patient::paginate(5);

select * from `appointments` where `appointments`.`id` = '5' limit 1
insert into `patients` (`appointment_id`, `doctor_id`, `speciality_id`, `image`, `advice`, `comments`, `updated_at`, `created_at`) values (5, 2, 1, 'Defualt Image', '', '', '2023-08-29 13:05:02', '2023-08-29 13:05:02')
---
    public function insert_patient($id)
    {
        $appointment = Appointment::find($id);
        $appointmentId = $appointment->id;
        $doctorId = $appointment->doctor_id;
        $specialityId = $appointment->speciality_id;

        $patient = new Patient();
        $patient->appointment_id = $appointmentId;
        $patient->doctor_id = $doctorId;
        $patient->speciality_id = $specialityId;

        $patient->image = "Defualt Image";
        $patient->advice = "";
        $patient->comments = "";
        $patient->save();

select * from `patients` where `patients`.`id` = '1' limit 1
---
    public function edit_patient($id)
    {
        $patient = Patient::find($id);