app/Http/Controllers/Admin/DoctorCommentController.php

select * from `replies` limit 5 offset 0
select count(*) as aggregate from `replies`
---
    public function allreply(){
        // $replies = Reply::all();
        $replies = Reply::paginate(5);