app/Http/Controllers/Admin/EventController.php

    public function index()
    {
        $event = Event::paginate(10);
---
select * from `events` limit 10 offset 0
select count(*) as aggregate from `events`

    public function store(Request $request)
    {
        $requestData = $request->except('file'); // Exclude 'file' from the request data
        $image = $request->file('file');

        if ($image) {
            $imageName = time() . '.' . $image->getClientOriginalExtension();
            $image->move(public_path('events'), $imageName);
            $requestData['image'] = $imageName;
        }

        Event::create($requestData);
---
insert into `events` (`name`, `title`, `description`, `image`, `updated_at`, `created_at`) values ('Mohim', 'Shifting goalposts: Research in the time of the coronavirus', 'Last month, Medical News Today published an interview with Dr. Catherine Oldenburg, an infectious disease epidemiologist and co-lead researcher of a new clinical trial investigating a potential treatment for COVID-19.\r\n\r\nIn the interview, Dr. Oldenburg commented on some unexpected ways in which the pandemic has affected how scientists conduct their research.\r\n\r\nItems that were readily available before the pandemic, such as laboratory or clinical trial supplies, have become more difficult to get hold of due to restrictions on international movement.\r\n\r\n“It’s interesting how many things we took for granted before COVID-19 — you know, [like the] moving of supplies,” Dr. Oldenburg remarked in the interview.\r\n\r\nWhat else has changed in the landscape of research as a result of the COVID-19 pandemic?\r\n\r\nIn this Special Feature, MNT “takes the pulse” of the research community to see where it now stands.', '1693323836.jpg', '2023-08-29 15:43:56', '2023-08-29 15:43:56')

    public function edit(Event $event)
    {
        $event = Event::find($event)?->first();
---
select * from `events` where `events`.`id` in (4, 0, 0, 0, 1693289455, 2023, 2023)

    public function update(Request $request, $id)
{
    $requestData = $request->except('file'); // Exclude 'file' from the request data
    $image = $request->file('file');

    if ($image) {
        $imageName = time() . '.' . $image->getClientOriginalExtension();
        $image->move(public_path('events'), $imageName);
        $requestData['image'] = $imageName;
    }

    $event = Event::findOrFail($id); // Find the event by its ID, not the requestData

    $event->update($requestData); // Update the event with the modified data
---
select * from `events` where `events`.`id` = '4' limit 1
update `events` set `image` = '1693321729.jpg', `events`.`updated_at` = '2023-08-29 15:08:49' where `id` = 4

    public function destroy($id)
    {
        $event = Event::findOrFail($id);
        $event->delete();
---
delete from `events` where `id` = 3