app/Http/Controllers/Admin/HomeController.php

select count(*) as aggregate from `users`
select count(*) as aggregate from `doctors`
select count(*) as aggregate from `appointments`
select count(*) as aggregate from `patients`
select count(*) as aggregate from `specialities`
select * from `doctors`
select * from `specialities`
select * from `events`
---
    public function redirect()
    {
        if (Auth::check()) {
            $userRole = Auth::user()->role;

            if ($userRole === 1) { // Assuming '1' corresponds to the admin role
                $userCount = User::count();
                $doctor = Doctor::count();
                $appointment = Appointment::count();
                $patient = Patient::count();
                $speciality = Speciality::count();
                return view('admin.home', compact('userCount', 'doctor', 'appointment', 'patient', 'speciality'));
            } else {
                $doctors = Doctor::all();
                $sp = Speciality::all();
                $events = Event::all();

select * from `doctors`
select * from `specialities`
select * from `events`
---
    public function index()
    {
        if (Auth::check()) {
            return redirect('home'); // Redirect to a route named 'home'
        } else {
            $doctors = Doctor::all();
            $sp = Speciality::all();
            $events = Event::all();

select * from `events`
---
    public function event()
    {

        $events = Event::all();

select * from `events` where `events`.`id` = '4' limit 1
---
    public function singleEvent($id)
    {
        $event = Event::find($id);

select * from `doctors` where `doctors`.`id` = '1' limit 1
select * from `comments` where `doctor_id` = 1
select * from `replies` where `comment_id` = 2
---
    public function show($id)
    {
        $doctor = Doctor::find($id);
        //$sp = Speciality::find($id);

        // Get the comments for the specific doctor
        $comments = Comments::where('doctor_id', $doctor->id)->get();

        // Create an array to store the replies for each comment
        $commentReplies = [];
        foreach ($comments as $comment) {
            // Get the replies for each comment
            $replies = Reply::where('comment_id', $comment->id)->get();

select * from `doctors`
select * from `specialities`
---
    public function doctor()
    {

        $doctors = Doctor::all();
        $sp = Speciality::all();

select * from `doctors` where `speciality_id` = '5'
---
    public function get_speciality($id)
    {
        $sc = Doctor::where("speciality_id", $id)->get();

select `name`, `id` from `doctors` where `speciality_id` = '1'
---
    public function apGetSpciality($id)
    {
        $aps = Doctor::where("speciality_id", $id)->pluck('name', 'id');