app/Http/Controllers/Admin/UserController.php

	public function index()
	{
		$users = User::paginate(5);
---
select * from `users` limit 5 offset 0
select count(*) as aggregate from `users`

	public function user_edit($id)
	{
		$users = User::findOrFail($id);
---
select * from `users` where `users`.`id` = '1' limit 1

	public function user_update(Request $request, $id)
	{
		$request->validate([
			'name' => 'required',
			'email' => 'required|email',
			'role' => 'required', // Assuming 'role' is a required field
		]);

		$user = User::findOrFail($id);
---
select * from `users` where `users`.`id` = '4' limit 1